{"meta":{"title":"Dream2Get Blog","subtitle":"Articles that make you learn","description":null,"author":"Dream2Get.com","url":"http://www.dream2get.com/blog"},"pages":[{"title":"About","date":"2016-10-30T03:36:58.000Z","updated":"2016-10-30T03:39:28.881Z","comments":true,"path":"about/index.html","permalink":"http://www.dream2get.com/blog/about/index.html","excerpt":"","text":"Welcome to Dream2get Blog."}],"posts":[{"title":"What's new in Selenium 3","slug":"What-s-new-in-Selenium-3","date":"2016-09-28T03:28:02.000Z","updated":"2016-10-09T04:14:21.574Z","comments":true,"path":"2016/09/28/What-s-new-in-Selenium-3/index.html","link":"","permalink":"http://www.dream2get.com/blog/blog/2016/09/28/What-s-new-in-Selenium-3/index.html","excerpt":"","text":"Whats new in Selenium 3Selenium 3 is already available in the official download site of seleniumhg at this location. While writing this article, current version is in beta format. But let’s see what is so special about this release that release numbering has been moved from 2.53 to 3.To understand the changes, first let us see what the future plans of this project is. Move to focus on Mobile and Web Apps Improve stability and capability of web driver: Focus more on webdriver API Removal of the original Selenium Core implementations. The reason for removal is because it uses purely JavaScript approach to perform automation related to actions and verification. For modern web applications using only this approach will be very complex, hard and time consuming. Providing support from open source community will also be difficult. Deprecating the RC APIs Selenium Java API divided into 3 packages: WebDriver Classes: Client side (selenium-java) Server: Command line remote server Leg-rc: Library that has Selenium interface and client-side classes allowing execution of legacy\\existing Selenium tests. Instead of Selenium Core, the leg-rc is backed by the WebDriver implementation. Basically it will contain: Old Selenium client-side classes. WebDriver Backed Selenium. Remote end point for SEL server. Note that this library will not be part of main selenium jar. It has to be downloaded separately. Move to WebDriver implementation to comply with W3C spec. This means: A more platform and language-neutral coding interface compatible with all major web browsers. Browse Vendors will be able to create/maintain browser specific implementations of WebDriver The users of WebDriver will now can continue to execute there tests in newer version of the browsers without much breakage/errors/delays Browser vendors will own drivers completely Driver Providers: Name Driver Firefox Support Via Mozilla’s geckodriver Safari Support on macOS Via Apple’s own safaridriver IE Support(9 or above) Via MS webdriver server Continued support for Chrome Via Google chromedriver Other changes: Minimum java version is now 8+ To run exported IDE tests, ensure that the leg-rc package is on the classpath New Html runner - New html-table runner is backed by WebDriver","categories":[],"tags":[{"name":"selenium","slug":"selenium","permalink":"http://www.dream2get.com/blog/tags/selenium/"}],"keywords":[]},{"title":"Welcome to the blog of learning","slug":"Welcome-to-the-blog-of-learning","date":"2016-09-28T03:27:40.000Z","updated":"2016-10-09T03:58:29.594Z","comments":true,"path":"2016/09/28/Welcome-to-the-blog-of-learning/index.html","link":"","permalink":"http://www.dream2get.com/blog/blog/2016/09/28/Welcome-to-the-blog-of-learning/index.html","excerpt":"","text":"","categories":[],"tags":[],"keywords":[]}]}